* This is my file

Practical sites:


I followed the steps of this site: https://streakycobra.github.io/posts/blogging-in-org-mode-with-nikola/

Other useful sites

- https://jiaweizhuang.github.io/blog/nikola-guide/
- https://www.frankliu.org/posts/setting-up-nikola-org-mode/

https://gist.github.com/redguardtoo

First install nikola
#+begin_src shell
pip install nikola
pip install aiohttp  # for nikola auto to work
pip install watchdog # for nikola auto to work
pip install ghp-import2 # for deploying to github
#+end_src


Then install the org mode plugin

#+begin_src shell
nikola plugin -i orgmode
#+end_src


* Set up org mode plugin



** code styling

#+begin_src shell
pygmentize -S default -a .highlight -f html >> files/assets/css/custom.css
#+end_src




** Update  init.el

Check the file =making-an-exercise-and-solution-environment.org= in ~posts/~ to see how to update ~init.el~

** Update the macros

Add =my-macros.org= to ~plugins/orgmode/macros.org~:


#+BEGIN_QUOTE
#+include: my-macros.org
#+END_QUOTE

~#+MACRO: newthought @@latex:\newthought{$1}@@@@html:<strong style="font-variant: all-small-caps">$1</strong>@@~

** Code styling

#+begin_src shell
pygmentize -S default -a .highlight -f html >> files/assets/css/custom.css
#+end_src



* compiling

#+begin_src shell
emacs --batch -l /home/nicky/Dropbox/homepage/plugins/orgmode/init.el --eval '(nikola-html-export "/home/nicky/Dropbox/homepage/posts/solving-a-number-game-with-a-mip-solver.org" "/home/nicky/Dropbox/homepage/cache/posts/solving-a-number-game-with-a-mip-solver.html")'
#+end_src


* Make a github io repo

Make an empty repo, no =readme= or -.gitignore=


#+begin_src shell
git clone https://github.com/ndvanforeest/ndvanforeest.github.io.git ~/homepage
cd homepage
git co -b src
nikola init my_site
#+end_src

Fill in the questions. My homepage is this: https://ndvanforeest.github.io/

#+begin_src shell
mv my_site/* .
rm -rf my_site/

git add README.org
#+end_src


* Making new posts


#+begin_src shell
nikola new_post -f orgmode -t "Solving a number game with a MIP solver"
#+end_src

#+RESULTS:
| Creating          | New     | Post |        |      |      |   |     |        |
| ----------------- |         |      |        |      |      |   |     |        |
|                   |         |      |        |      |      |   |     |        |
| Title:            | Solving | a    | number | game | with | a | MIP | solver |

It seems that when updating files that are symlinks, that =nikola= does not quite get the updates.


* Test locally

#+begin_src shell
nikola serve
#+end_src

#+begin_src shell
nikola auto
#+end_src




* Making new pages

#+begin_src shell
nikola new_page -f orgmode -t "bio"
#+end_src

#+RESULTS:
| Creating          | New | Page |
| ----------------- |     |      |
|                   |     |      |
| Title:            | bio |      |


* Upload to github

Stay in the =src= branch! Don't commmit. The following handles all.

#+begin_src shell
cd /home/nicky/Dropbox/homepage/
nikola github_deploy
#+end_src

Clean up:

#+begin_src shell
cd /home/nicky/Dropbox/homepage/
nikola check --clean-files
#+end_src
